HIPHelper/WebContent/SOAP/SOAPQueryTemplate.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
	<soap:Header/>
	<soap:Body>
		<query:AdhocQueryRequest
			xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
			xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
			<query:ResponseOption returnComposedObjects="true" returnType="LeafClass"/>
			<AdhocQuery
				id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
				<Slot
					name="$XDSDocumentEntryPatientId">
					<ValueList>
						<Value>'--PATIENT_ID--^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO'</Value>
					</ValueList>
				</Slot>
				<Slot
					name="$XDSDocumentEntryStatus">
					<ValueList>
						<Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</Value>
					</ValueList>
				</Slot>
			</AdhocQuery>
		</query:AdhocQueryRequest>
	</soap:Body>
</soap:Envelope>